[
  {
    "id": "riyadh-province",
    "arabic_name": "منطقة الرياض",
    "description": "منطقة الرياض هي قلب المملكة العربية السعودية وعاصمتها. تتميز بتنوعها الجغرافي الذي يشمل الصحاري الشاسعة، الواحات الخضراء مثل وادي حنيفة، والتكوينات الصخرية الفريدة مثل حافة العالم. تزدهر فيها العديد من النباتات الصحراوية المتكيفة والنباتات الشجرية في الوديان."
  },
  {
    "id": "makkah-province",
    "arabic_name": "منطقة مكة المكرمة",
    "description": "منطقة مكة المكرمة تقع على الساحل الغربي للمملكة، وتشتهر بتضاريسها الجبلية القاسية ومناخها الحار. تضم العديد من الأودية والشعاب التي تحتضن نباتات متكيفة مع البيئة الجافة مثل الطلح والسمر والسدر، بالإضافة إلى بعض الأنواع الجبلية."
  },
  {
    "id": "eastern-province",
    "arabic_name": "المنطقة الشرقية",
    "description": "تعد المنطقة الشرقية أكبر مناطق المملكة وتغطي جزءًا كبيرًا من صحراء الربع الخالي. تتميز ببيئتها الصحراوية الساحلية وتأثرها بالنفط. نباتاتها في الغالب صحراوية قادرة على تحمل الملوحة والجفاف مثل الرمث والعوسج، وتظهر الواحات النادرة بعض التنوع النباتي."
  },
  {
    "id": "aljowf-province",
    "arabic_name": "منطقة الجوف",
    "description": "تقع منطقة الجوف في شمال المملكة وتشتهر بخصوبة أراضيها الزراعية، خاصة زراعة الزيتون والنخيل. تتأثر بمناخ صحراوي بارد شتاءً وحار صيفاً، وتضم بيئات طبيعية متنوعة من الكثبان الرملية إلى الأراضي المستوية التي تدعم نباتات برية وشجيرات."
  },
  {
    "id": "albahah-province",
    "arabic_name": "منطقة الباحة",
    "description": "منطقة الباحة هي جزء من المرتفعات الجنوبية الغربية، وتتميز بجمال طبيعتها وجبالها الشاهقة وأوديتها الخضراء. مناخها معتدل نسبيًا مقارنة ببقية مناطق المملكة، مما يدعم غطاءً نباتيًا أكثر كثافة وتنوعًا يشمل أشجار العرعر والزيتون البري والعديد من الشجيرات العطرية."
  },
  {
    "id": "najran-province",
    "arabic_name": "منطقة نجران",
    "description": "منطقة نجران ذات طابع جغرافي متنوع يجمع بين الصحراء والوديان والجبال. تشتهر بزراعة النخيل في الواحات، وتضم نباتات متكيفة مع المناخ الجاف مثل أشجار السنط والشجيرات الصحراوية، بالإضافة إلى بعض الأنواع النباتية التي تنمو على سفوح الجبال."
  },
  {
    "id": "northern-borders_province",
    "arabic_name": "منطقة الحدود الشمالية",
    "description": "تتميز منطقة الحدود الشمالية بكونها سهولاً واسعة وصحاري رملية وحصوية. مناخها شديد البرودة شتاءً وحار صيفاً. نباتاتها غالبًا ما تكون حوليات وحشائش وشجيرات صحراوية صغيرة تنمو بعد هطول الأمطار، وتستخدم كمرعى طبيعي."
  },
  {
    "id": "alqassim-province",
    "arabic_name": "منطقة القصيم",
    "description": "القصيم هي سلة غذاء المملكة، تشتهر بخصوبة تربتها ووفرة مياهها الجوفية، مما جعلها مركزاً زراعياً رئيسياً خاصة للنخيل والخضروات. بيئتها الطبيعية كانت تضم شجيرات صحراوية ونباتات حولية، وتأثرت بالزراعة المكثفة."
  },
  {
    "id": "aseer-province",
    "arabic_name": "منطقة عسير",
    "description": "تعد منطقة عسير من أجمل المناطق السعودية وأكثرها خضرة، بفضل ارتفاعها الشاهق وتأثرها بالرياح الموسمية التي تجلب الأمطار. تتميز بتنوعها البيولوجي الكبير وغاباتها الكثيفة من أشجار العرعر والزيتون البري، وتضم أنواعًا فريدة من النباتات والزهور."
  },
  {
    "id": "jazan-province",
    "arabic_name": "منطقة جازان",
    "description": "منطقة جازان ذات طبيعة استوائية وشبه استوائية، تقع على السهل التهامي وعلى ساحل البحر الأحمر. تتميز بوفرة المياه وخصوبة التربة، وتضم غطاءً نباتيًا كثيفًا ومتنوعًا يشمل أشجار المانجو والبن، بالإضافة إلى النباتات الشاطئية والوديان."
  },
  {
    "id": "almadinah-province",
    "arabic_name": "منطقة المدينة المنورة",
    "description": "تتميز منطقة المدينة المنورة بتضاريس متنوعة بين الجبال البركانية والسهول والأودية. مناخها حار جاف. نباتاتها تتكيف مع هذه الظروف وتشمل أشجار النخيل والسدر، بالإضافة إلى بعض النباتات الحولية التي تظهر بعد الأمطار في الأودية والشعاب."
  },
  {
    "id": "hail-province",
    "arabic_name": "منطقة حائل",
    "description": "تقع منطقة حائل في الجزء الشمالي الأوسط من المملكة، وتشتهر بتنوع تضاريسها من جبال (مثل أجا وسلمى) إلى سهول رملية. مناخها قاري. نباتاتها غالبًا ما تكون صحراوية متكيفة مع البرودة شتاءً والحرارة صيفًا، وتشمل أنواعًا من الشجيرات والأعشاب البرية."
  },
  {
    "id": "tabuk-province",
    "arabic_name": "منطقة تبوك",
    "description": "منطقة تبوك في شمال غرب المملكة، تتميز بتنوعها البيئي الذي يجمع بين المناطق الساحلية على البحر الأحمر والصحاري والجبال (مثل جبال حسمى). مناخها معتدل نسبيًا في بعض الأجزاء. تضم نباتات صحراوية متكيفة وأنواع نباتية فريدة في بيئاتها الجبلية."
  }
]
